Application/app/controllers/members_controller.rb

INSERT INTO "members" ("username", "first", "last", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "anu1@gmail.com"], ["first", "Anu"], ["last", "Khatri"], ["created_at", "2022-02-02 04:32:18.150601"], ["updated_at", "2022-02-02 04:32:18.150601"]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE "members" SET "first" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["first", "Ankito"], ["updated_at", "2022-02-03 19:55:10.923823"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)

DELETE FROM "members" WHERE "members"."id" = $1  [["id", 1]]
---
  def destroy
    @member.destroy