Application/app/controllers/products_controller.rb

  def index
    @user = User.find_by_id(session[:id])
    @products = @user.products.all
---
SELECT "products".* FROM "products"

  def marketplace
    @tags = Tag.all
    @users = User.all
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @user = User.find_by_id(session[:id])
    product_params = params.require(:product).permit(:title, :image, :price, :tag_list, :tag, { tag_ids: [] }, :tag_ids, :quantity)
    @product = @user.products.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "backpack"], ["created_at", "2022-01-06 16:51:12.204105"], ["updated_at", "2022-01-06 16:51:12.204105"]]

  def update
    product_params = params.require(:product).permit(:title, :image, :price, :tag_list, :tag, { tag_ids: [] }, :tag_ids, :quantity)
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["title", "cap"], ["updated_at", "2022-01-06 19:13:58.825329"], ["id", 11]]

  def destroy
    @user = User.find_by_id(session[:id])
    @product = @user.products.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]