Application/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: params[:session][:username].downcase)
    @member = Member.find_by(username: params[:session][:username].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test3@gmail.com"], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."username" = $1 LIMIT $2  [["username", "anu3@gmail.com"], ["LIMIT", 1]]