Application/app/views/members/show.html.erb

<% if logged_in_member? %>
    <% if User.find_by_id(current_member.users_id) == nil %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]