app/controllers/dashboards_controller.rb

    def dashboard
      @user = User.find_by_id(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 368], ["LIMIT", 1]]