app/controllers/members_controller.rb

SELECT "members".* FROM "members" WHERE "members"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def edit
    @member = Member.find_by_id(session[:id])

SELECT "members".* FROM "members" WHERE "members"."username" = $1 LIMIT $2  [["username", "anukhatri41@gmail.com"], ["LIMIT", 1]]
INSERT INTO "members" ("username", "password_digest", "first", "last", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "members" SET "referral_code" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["referral_code", "3gls00ik"], ["updated_at", "2022-04-19 17:07:56.985540"], ["id", 5]]
---
  def create
    @member = Member.new(member_params)
    if /\A[^@\s]+@[^@\s]+\z/.match(@member.username) == nil # checks if the username is a valid email address
        flash[:notice] = "Invalid Username"
        redirect_to '/signup_member'
    elsif Member.find_by(username: @member.username) # checks to see if the username already exists
        flash[:notice] = "Username already exists"
        redirect_to '/signup_member'
    elsif @member.password.length < 8 # checks to ensure that the password length is at least 8 characters long
        flash[:notice] = "Password length should be 8 or longer."
        redirect_to '/signup_member'
    else @member.valid? # if has all valid parameters, create the member in the table
        @member = Member.create(params.require(:member).permit(:first, :last, :username, :password))
        @member.update_attribute(:referral_code, rand(36**8).to_s(36))

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "members" SET "username" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["username", "rspec10"], ["updated_at", "2022-03-09 04:04:54.214008"], ["id", 7]]
---
  def update
    @member = Member.find_by_id(session[:id])
    # user_params = params.require(:user).permit(:username, :password, :first, :last)
    @member.assign_attributes(params.require(:member).permit(:first, :last, :username, :password))
    if @member.changed?
        if @member.save

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 8]]
---
  def destroy
    @member = Member.find_by_id(session[:id])
    @member.destroy