app/controllers/orders_controller.rb

    def create_order
        price = session[:total]
        request = PayPalCheckoutSdk::Orders::OrdersCreateRequest::new
        request.request_body({
          :intent => 'CAPTURE',
          :purchase_units => [
            {
              :amount => {
                :currency_code => 'USD',
                :value => price
              }
            }
          ]
        })
        begin
          response = @client.execute request
          order = Order.new
          order.price = price.to_i
          order.token = response.result.id
          if order.save
---
INSERT INTO "orders" ("token", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["token", "3EH942129Y817392K"], ["price", "100.0"], ["created_at", "2022-04-22 06:42:09.868928"], ["updated_at", "2022-04-22 06:42:09.868928"]]