app/controllers/products_controller.rb

  def index
    @user = User.find_by_id(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def view_cart
    @cart_ids = session[:cart]
    @total = 0
    if @cart_ids != nil
      @cart_ids.each do |cart_id|
        @total += Product.find_by_id(cart_id).price
      end
    end

    session[:total] = @total

    @member_refer = Member.find_by_referral_code(session[:referral])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."referral_code" IS NULL LIMIT $1  [["LIMIT", 1]]

  def add_to_cart
    session[:cart] ||= []
    session[:cart] << params[:product_id]

    @product = Product.find_by_id(params[:product_id])
    new_quantity = @product.quantity - 1
    @product.update_attribute(:quantity, new_quantity)

    @member_refer ||= Member.find_by_referral_code(session[:referral])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 9], ["updated_at", "2022-04-22 06:42:10.608347"], ["id", 1]]
SELECT "members".* FROM "members" WHERE "members"."referral_code" IS NULL LIMIT $1  [["LIMIT", 1]]

  def remove_from_cart
    session[:cart].delete_at(session[:cart].index(params[:product_id]))
    @product = Product.find_by_id(params[:product_id])
    new_quantity = @product.quantity + 1
    @product.update_attribute(:quantity, new_quantity)

    @member_refer ||= Member.find_by_referral_code(session[:referral])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 10], ["updated_at", "2022-04-22 06:42:11.495611"], ["id", 10]]
SELECT "members".* FROM "members" WHERE "members"."referral_code" IS NULL LIMIT $1  [["LIMIT", 1]]

  def tag_marketplace
    if params[:tag_id] == nil
      redirect_to "/marketplace"
    end
    @selected_tag = Tag.find_by_id(params[:tag_id]).name
    @product_ids = Tagging.where(tag_id: params[:tag_id]).pluck(:product_id)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "taggings"."product_id" FROM "taggings" WHERE "taggings"."tag_id" = $1  [["tag_id", 1]]

  def create
    @user = User.find_by_id(session[:id])
    product_params = params.require(:product).permit(:title, :image, :price, :tag_list, :tag, { tag_ids: [] }, :tag_ids, :quantity)
    @product = @user.products.new(product_params)

    respond_to do |format|
      if @product.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "products" ("title", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Bottle"], ["price", "10.99"], ["quantity", 5], ["user_id", 6], ["created_at", "2022-04-22 02:39:03.893556"], ["updated_at", "2022-04-22 02:39:03.893556"]]

  def update
    product_params = params.require(:product).permit(:title, :image, :price, :tag_list, :tag, { tag_ids: [] }, :tag_ids, :quantity)
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["title", "A Bottle"], ["updated_at", "2022-01-24 03:20:13.828244"], ["id", 30]]

  def destroy
    @user = User.find_by_id(session[:id])
    @product = @user.products.find(params[:id])
    @product.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 30]]