app/controllers/users_controller.rb

    def index
        @user = User.find_by_id(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def remove_member
        @member = Member.find_by_id(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create_new_member
        @user = User.find_by_id(session[:id])
        if Member.exists?(username: params[:username])
            @member = Member.find_by_username(params[:username])
            @member.update_attribute(:users_id, @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."username" = $1 LIMIT $2  [["username", "rspec_member@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "members" WHERE "members"."username" = $1 LIMIT $2  [["username", "rspec_member@gmail.com"], ["LIMIT", 1]]
UPDATE "members" SET "users_id" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["users_id", 1], ["updated_at", "2022-04-22 06:42:11.589028"], ["id", 1]]

    def create
        @user = User.new(user_params)
        if /\A[^@\s]+@[^@\s]+\z/.match(@user.username) == nil # checks to see if its a valid username / email
            flash[:notice] = "Invalid Username"
            redirect_to '/signup_organization'
        elsif User.find_by(username: @user.username) # checks to see if the username already exists in the organization table
            flash[:notice] = "Username already exists"
            redirect_to '/signup_organization'
        elsif @user.password.length < 8 # ensures that the password length is more than 8
            flash[:notice] = "Password length should be 8 or longer."
            redirect_to '/signup_organization'
        else @user.valid? # creates user in organization table
            @user = User.create(params.require(:user).permit(:first, :username, :password))
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "outdoors@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "first", "last", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        @user = User.find_by_id(session[:id])
        # user_params = params.require(:user).permit(:username, :password, :first, :last)
        @user.assign_attributes(params.require(:user).permit(:first, :last, :username, :password))
        if @user.changed?
            if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "rspec10"], ["updated_at", "2022-01-24 03:41:20.549442"], ["id", 73]]

    def destroy
        @user = User.find_by_id(session[:id])
        Member.where(users_id: @user.id).update_all(users_id: nil)
        # @members.update_all(:users_id, nil)
        @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "members" SET "users_id" = $1 WHERE "members"."users_id" = $2  [["users_id", nil], ["users_id", 4]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 24]]

    def show
        @user = User.find_by_id(session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]