app/views/products/view_cart.html.erb

					<div id="prodinfo">
						<span style="color:black"><%= Product.find_by_id(cart_id).title %></span>
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]