app/views/members/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
<% if logged_in_member? %>
    <% if User.find_by_id(current_member.users_id) == nil %>